Show / Hide Table of Contents
Enum LoadCaseSubType
Load case sub type
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum LoadCaseSubType
Fields
 Name |  Description
 PermanentPrestress
Permanent - prestress (posttensioned)
 PermanentPrestressPretensioned
Permanent - prestress (posttensioned)
 PermanentPrestressPrimary
Permanent - prestress primary effect
 PermanentPrimaryEffect
Permanent - primary effect
 PermanentRheologic
Permanent - Rheologic
 PermanentSelfweight
Permanent - self weight
 PermanentSelfweightLocal
Permanent - self weight - local
 PermanentStandard
Permanent - standard
 VariableDynamic
Variable - dynamic
 VariablePrimaryEffect
Variable - primary effect
 VariableStatic
Variable - static
 Improve this Doc
 View Source